src/Documents/АктОказанияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АктОказанияУслуг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленВКонтурСтрахование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОказанныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СообщенияКонтурСтрахование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СообщенияКонтурСтрахование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>documentDate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>documentNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>documentType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>checkingStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>contentType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationCompletionTimestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationStartTimestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lastEventPointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>messageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reasons</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recipientMediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>senderMediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>totalWorkTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеКС</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>mediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventPointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventDateTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗначенияПараметровОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровОбследований</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Comment>Порядок вывода реквизита в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонОбследования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Зуб</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОбращения</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияПараметровОбследований</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыСтраховыхДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСтраховыхДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фактовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/АктОказанияУслуг/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница; 
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница));
	
	ВнешняяСистемаКС = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.КонтурСтрахование, Истина);
	
	Если ЗначениеЗаполнено(ВнешняяСистемаКС) Тогда
		
		Элементы.ОтправитьДанныеВКС.Видимость = Истина;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Установить отбор по структурной единице
Процедура ОтборСтруктурнаяЕдиницаПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница));
КонецПроцедуры

&НаКлиенте
// Устанвовить отбор по страховой компании
Процедура ОтборСтраховаяКомпанияПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборСтраховаяКомпания, ЗначениеЗаполнено(ОтборСтраховаяКомпания));
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ОтборДоговорПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Договор", ОтборДоговор, ЗначениеЗаполнено(ОтборДоговор));
	
КонецПроцедуры

&НаКлиенте
// Процедура печати.
//
Процедура ДокументПечать(Команда)	
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "АктОказанияУслуг");	
	Структура.Вставить("МассивДокументов", Элементы.Список.ВыделенныеСтроки);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);									
	//ПоказатьВыборИзСписка(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, ТекущийЭлемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()                           	
	Возврат Документы.АктОказанияУслуг.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаСервере
// Процедура, отправляет данные по акту оказанных услуг в Контр.Страхование.
//
Процедура ОтправитьДанныеВКСНаСервере(Акт)
	
	ВнешняяСистемаКС = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.КонтурСтрахование, Истина);
	token = ВнешняяСистемаКС.ТокенДоступа;
	ПараметрыВС = ВнешняяСистемаКС.Параметры.Получить(); 
	mediIdСК = "";
	mediIdОрганизации = "";
	Для Каждого ЭлементМ Из ПараметрыВС.МассивОрганизаций Цикл
		Если ЭлементМ.partyTypeCode = "Insurer"  И Акт.Контрагент.ИНН = ЭлементМ.inn И Акт.Контрагент.КПП = ЭлементМ.kpp Тогда
			mediIdСК = ЭлементМ.mediId;
		ИначеЕсли ЭлементМ.partyTypeCode = "Clinic" Тогда
			mediIdОрганизации = ЭлементМ.mediId;
		КонецЕсли;
	КонецЦикла;      
	
	Если Не ЗначениеЗаполнено(mediIdСК) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена организация получатель.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(mediIdОрганизации) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена организация отправитель.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос("/V2/messages");
	Запрос.Заголовки.Вставить("Authorization", "Bearer "+token);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");

	ПутьКФайлу = ПолучитьПутьКФайлу(Акт, mediIdОрганизации, mediIdСК);
	
	ДвоичныеДанныеЗаписи = Новый ДвоичныеДанные(ПутьКФайлу);
	
	message = Base64Строка(ДвоичныеДанныеЗаписи);

	СтрокаJSON = "{ ""mediId"": """ + mediIdОрганизации + """, ""message"": """ + message + """}";

	Запрос.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
	
	//ЗапуститьПриложение(ПутьКФайлу);
	
	Ответ = Клиент_post(Запрос,ХостАпи(ПараметрыВС.Демо));    
	
	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение "Сообщение не найдено: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 401 Тогда
		ВызватьИсключение "Запрос не авторизован: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 400 Тогда
		ВызватьИсключение "Некорректный формат идентификатора сообщения: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение "Не удалось выполнить запрос: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 200 Тогда // Всё хорошо
		джсон = Новый ЧтениеJSON;
		джсон.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		ОтветСервера = ПрочитатьJSON(джсон);
		джсон.Закрыть();
		
		НаборЗаписей = РегистрыСведений.СообщенияКонтурСтрахование.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.mediId.Установить(mediIdОрганизации);
		НаборЗаписей.Отбор.eventId.Установить(Строка(Акт.УникальныйИдентификатор()));
		НаборЗаписей.Отбор.eventType.Установить("NewInboxMessage"); 
        НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			НовыйНомер = НаборЗаписей.Добавить();
		Иначе
			НовыйНомер = НаборЗаписей[0];	
		КонецЕсли;
				
		НовыйНомер.mediId			= mediIdОрганизации;
		НовыйНомер.eventId			= Строка(Акт.УникальныйИдентификатор());
		НовыйНомер.eventPointer		= Строка(Новый УникальныйИдентификатор);
		НовыйНомер.eventType		= "NewInboxMessage"; 

		НовыйНомер.eventDateTime	= Строка(ТекущаяДатаСеанса());
		НовыйНомер.documentDate		= Строка(Акт.Дата);	
		НовыйНомер.documentNumber   = Строка(Акт.Номер);	
		НовыйНомер.documentType     = "Ihclme";
		
		НовыйНомер.senderMediId     = mediIdОрганизации;
		НовыйНомер.recipientMediId  = mediIdСК;
		НовыйНомер.contentType 		= "NewInboxMessageEventContent";
		НовыйНомер.messageId		= ОтветСервера.messageId;
		
		lastEventPointer = РегистрыСведений.СообщенияКонтурСтрахование.ПоследнееПисьмо();
		НовыйНомер.lastEventPointer	= lastEventPointer; 
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение	
			
		КонецПопытки;  
		АктОбъект = Акт.ПолучитьОбъект();
		АктОбъект.ОтправленВКонтурСтрахование = Истина; 
		АктОбъект.Комментарий = "Отправлен в Контур.Страхование"; 
		АктОбъект.Записать();
		
		// ОтветСервера.messageId - Id отправленного сообщения, по которому потом читать ленту и мониторить статус отправки и обработки

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция возвращает путь к файлу
//
Функция ПолучитьПутьКФайлу(Акт, mediIdОрганизации, mediIdСК)
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(ПутьКФайлу, "UTF-8"); 
	Запись.ЗаписатьОбъявлениеXML();
    Запись.ЗаписатьНачалоЭлемента("eDIMessage");
	Запись.ЗаписатьАтрибут("id", Строка(Акт.УникальныйИдентификатор()));
	
		Запись.ЗаписатьНачалоЭлемента("interchangeHeader");
	
			Запись.ЗаписатьНачалоЭлемента("sender");
			Запись.ЗаписатьТекст(mediIdОрганизации);
			Запись.ЗаписатьКонецЭлемента();
	
			Запись.ЗаписатьНачалоЭлемента("recipient");
			Запись.ЗаписатьТекст(mediIdСК);
			Запись.ЗаписатьКонецЭлемента();
		
			Запись.ЗаписатьНачалоЭлемента("documentType");
			Запись.ЗаписатьТекст("IHCLME");
			Запись.ЗаписатьКонецЭлемента();

			Запись.ЗаписатьНачалоЭлемента("creationDateTime"); 
			Запись.ЗаписатьТекст(ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO));
  			Запись.ЗаписатьКонецЭлемента();
		    
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("healthCareClaim");
		Запись.ЗаписатьАтрибут("healthCareClaimDate", Формат(Акт.Дата, "ДФ=yyyy-MM-dd"));
		Запись.ЗаписатьАтрибут("healthCareClaimNumber", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Акт.Номер, Акт.Организация.Префикс));
		
			Запись.ЗаписатьНачалоЭлемента("claimPeriodFrom");
			Запись.ЗаписатьТекст(Формат(Акт.НачалоПериода, "ДФ=yyyy-MM-dd"));
			Запись.ЗаписатьКонецЭлемента();                  
			
			Запись.ЗаписатьНачалоЭлемента("claimPeriodTo");
			Запись.ЗаписатьТекст(Формат(Акт.ОкончаниеПериода, "ДФ=yyyy-MM-dd"));
			Запись.ЗаписатьКонецЭлемента();
			
			Запись.ЗаписатьНачалоЭлемента("contractIdentificator");
			Запись.ЗаписатьАтрибут("date", Формат(Акт.Договор.ДатаДоговора, "ДФ=yyyy-MM-dd"));
			Запись.ЗаписатьАтрибут("number", Строка(Акт.Договор.НомерДоговора));
			Запись.ЗаписатьКонецЭлемента();
			
			// Доп соглашение к договору
			//Запись.ЗаписатьНачалоЭлемента("supplementaryAgreementIdentificator");
			//Запись.ЗаписатьАтрибут("date", Формат(ТекСтрока.Дата, "ДФ=yyyy-MM-dd"));
			//Запись.ЗаписатьАтрибут("number", Строка(ТекСтрока.Номер));
			//Запись.ЗаписатьКонецЭлемента();
			
			// Номер и дата акта выполненных работ 
			Запись.ЗаписатьНачалоЭлемента("acceptanceCertificateIdentificator");
			Запись.ЗаписатьАтрибут("date", Формат(Акт.Дата, "ДФ=yyyy-MM-dd"));
			Запись.ЗаписатьАтрибут("number", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Акт.Номер, Акт.Организация.Префикс));
			Запись.ЗаписатьКонецЭлемента();
			
			// Номер и дата счета на оплату 
			Запись.ЗаписатьНачалоЭлемента("proformaInvoiceIdentificator");
			Запись.ЗаписатьАтрибут("date", Формат(Акт.Дата, "ДФ=yyyy-MM-dd"));
			Запись.ЗаписатьАтрибут("number", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Акт.Номер, Акт.Организация.Префикс));
			Запись.ЗаписатьКонецЭлемента();
			
			// Номер и дата счета-фактуры
			Запись.ЗаписатьНачалоЭлемента("invoiceIdentificator");
			Запись.ЗаписатьАтрибут("date", Формат(Акт.Дата, "ДФ=yyyy-MM-dd"));
			Запись.ЗаписатьАтрибут("number", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Акт.Номер, Акт.Организация.Префикс));
			Запись.ЗаписатьКонецЭлемента();
			
			// Условия оплаты. Варианты: Prepaid(Предоплата), Postpaid(Постоплата)
			Запись.ЗаписатьНачалоЭлемента("termsOfPayment");
				Запись.ЗаписатьНачалоЭлемента("providedServicePaymentType");
					Запись.ЗаписатьТекст(?(Акт.Договор.ПрограммаСтрахования.ВидДоговора = Перечисления.ВидыСтраховыхДоговоров.Предоплата, "Prepaid", "Postpaid"));
				Запись.ЗаписатьКонецЭлемента();
			Запись.ЗаписатьКонецЭлемента();

            Запись.ЗаписатьНачалоЭлемента("insuranceCompany");
			
				Запись.ЗаписатьНачалоЭлемента("mediId");
			    Запись.ЗаписатьТекст(mediIdСК);
				Запись.ЗаписатьКонецЭлемента();
				
				Запись.ЗаписатьНачалоЭлемента("organization");
				
					Запись.ЗаписатьНачалоЭлемента("name");
			    	Запись.ЗаписатьТекст(Акт.Контрагент.Наименование);
					Запись.ЗаписатьКонецЭлемента();

					Запись.ЗаписатьНачалоЭлемента("inn");
			    	Запись.ЗаписатьТекст(Акт.Контрагент.ИНН);
					Запись.ЗаписатьКонецЭлемента();

					Запись.ЗаписатьНачалоЭлемента("kpp");
			    	Запись.ЗаписатьТекст(Акт.Контрагент.КПП);
					Запись.ЗаписатьКонецЭлемента();

				Запись.ЗаписатьКонецЭлемента();
				
				МассивАдресов =  Акт.Контрагент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
				Если МассивАдресов.Количество() > 0 Тогда
				
					ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(МассивАдресов[0].Значение, Перечисления.ТипыКонтактнойИнформации.Адрес);
				
					Если НЕ ДанныеАдреса.addressType = "ВСвободнойФорме" Тогда
						
						Запись.ЗаписатьНачалоЭлемента("russianAddress");
						
							Если ЗначениеЗаполнено(ДанныеАдреса.ZIPcode) Тогда
								Запись.ЗаписатьНачалоЭлемента("postalCode");
								Запись.ЗаписатьТекст(ДанныеАдреса.ZIPcode);
								Запись.ЗаписатьКонецЭлемента();   
							КонецЕсли;	
								
							//Запись.ЗаписатьНачалоЭлемента("regionISOCode");
							//Запись.ЗаписатьТекст(ДанныеАдреса);
							//Запись.ЗаписатьКонецЭлемента();   
							
							Если ЗначениеЗаполнено(ДанныеАдреса.district) Тогда
  								Запись.ЗаписатьНачалоЭлемента("district");
								Запись.ЗаписатьТекст(ДанныеАдреса.district);
								Запись.ЗаписатьКонецЭлемента();   
							КонецЕсли;	
							
							Город = ДанныеАдреса.city;
							Если ДанныеАдреса.area = "Москва" Тогда
								Город = "Москва";
							ИначеЕсли ДанныеАдреса.area = "Санкт-Петербург" Тогда
								Город = "Санкт-Петербург";
							ИначеЕсли ДанныеАдреса.area = "Севастополь" Тогда
								Город = "Севастополь";
							ИначеЕсли ДанныеАдреса.area = "Байконур" Тогда
								Город = "Байконур";
							КонецЕсли;	
							Если Город <> "" Тогда 
								Запись.ЗаписатьНачалоЭлемента("city");
								Запись.ЗаписатьТекст(Город);
								Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДанныеАдреса.settlement) Тогда
								Запись.ЗаписатьНачалоЭлемента("settlement");
								Запись.ЗаписатьТекст(ДанныеАдреса.settlement);
								Запись.ЗаписатьКонецЭлемента();   
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДанныеАдреса.street) Тогда
								Запись.ЗаписатьНачалоЭлемента("street");
								Запись.ЗаписатьТекст(ДанныеАдреса.street);
								Запись.ЗаписатьКонецЭлемента();   
                            КонецЕсли;
							
							Если ЗначениеЗаполнено(ДанныеАдреса.houseNumber) Тогда
								Запись.ЗаписатьНачалоЭлемента("house");
								Запись.ЗаписатьТекст(ДанныеАдреса.houseNumber);
								Запись.ЗаписатьКонецЭлемента();   
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДанныеАдреса.buildings) И ДанныеАдреса.buildings.Количество() > 0 Тогда
								Запись.ЗаписатьНачалоЭлемента("building");
								Запись.ЗаписатьТекст(ДанныеАдреса.buildings[0].number);
								Запись.ЗаписатьКонецЭлемента(); 
							КонецЕсли;
						
							//Запись.ЗаписатьНачалоЭлемента("office");
							//Запись.ЗаписатьТекст(ДанныеАдреса);
							//Запись.ЗаписатьКонецЭлемента();   
							
							Если ЗначениеЗаполнено(ДанныеАдреса.value) Тогда
								Запись.ЗаписатьНачалоЭлемента("fullAddress");
								Запись.ЗаписатьТекст(ДанныеАдреса.value);
								Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
							
						Запись.ЗаписатьКонецЭлемента(); 
					КонецЕсли; 
					
				КонецЕсли;
				
				БанковскийСчет = Акт.Контрагент.БанковскийСчетПоУмолчанию;
				
				Если ЗначениеЗаполнено(БанковскийСчет) Тогда
					Запись.ЗаписатьНачалоЭлемента("additionalInfo");
					
						Запись.ЗаписатьНачалоЭлемента("bankAccountNumber");
						Запись.ЗаписатьТекст(БанковскийСчет.НомерСчета);
						Запись.ЗаписатьКонецЭлемента();

	        			Запись.ЗаписатьНачалоЭлемента("correspondentAccountNumber");
						Запись.ЗаписатьТекст(БанковскийСчет.Банк.КоррСчет);
						Запись.ЗаписатьКонецЭлемента();

						Запись.ЗаписатьНачалоЭлемента("bankName");
						Запись.ЗаписатьТекст(БанковскийСчет.Наименование);
						Запись.ЗаписатьКонецЭлемента();

               			Запись.ЗаписатьНачалоЭлемента("BIK");
						Запись.ЗаписатьТекст(БанковскийСчет.Банк.Код);
						Запись.ЗаписатьКонецЭлемента();
					
					Запись.ЗаписатьКонецЭлемента();
                КонецЕсли;
			Запись.ЗаписатьКонецЭлемента();
			
   			Запись.ЗаписатьНачалоЭлемента("healthCareProvider");

				Запись.ЗаписатьНачалоЭлемента("mediId");
			    Запись.ЗаписатьТекст(mediIdОрганизации);
				Запись.ЗаписатьКонецЭлемента();
				
				Запись.ЗаписатьНачалоЭлемента("organization");
				
					Запись.ЗаписатьНачалоЭлемента("name");
			    	Запись.ЗаписатьТекст(Акт.Организация.Наименование);
					Запись.ЗаписатьКонецЭлемента();

					Запись.ЗаписатьНачалоЭлемента("inn");
			    	Запись.ЗаписатьТекст(Акт.Организация.ИНН);
					Запись.ЗаписатьКонецЭлемента();

					Запись.ЗаписатьНачалоЭлемента("kpp");
			    	Запись.ЗаписатьТекст(Акт.Организация.КПП);
					Запись.ЗаписатьКонецЭлемента();

				Запись.ЗаписатьКонецЭлемента();
			
			    МассивАдресов =  Акт.Организация.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
				Если МассивАдресов.Количество() > 0 Тогда
				
					ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(МассивАдресов[0].Значение, Перечисления.ТипыКонтактнойИнформации.Адрес);
				
					Если НЕ ДанныеАдреса.addressType = "ВСвободнойФорме" Тогда
						
						Запись.ЗаписатьНачалоЭлемента("russianAddress");
						
							Если ЗначениеЗаполнено(ДанныеАдреса.ZIPcode) Тогда
								Запись.ЗаписатьНачалоЭлемента("postalCode");
								Запись.ЗаписатьТекст(ДанныеАдреса.ZIPcode);
								Запись.ЗаписатьКонецЭлемента();   
							КонецЕсли;	
								
							//Запись.ЗаписатьНачалоЭлемента("regionISOCode");
							//Запись.ЗаписатьТекст(ДанныеАдреса);
							//Запись.ЗаписатьКонецЭлемента();   
							
							Если ЗначениеЗаполнено(ДанныеАдреса.district) Тогда
  								Запись.ЗаписатьНачалоЭлемента("district");
								Запись.ЗаписатьТекст(ДанныеАдреса.district);
								Запись.ЗаписатьКонецЭлемента();   
							КонецЕсли;	
							
							Город = ДанныеАдреса.city;
							Если ДанныеАдреса.area = "Москва" Тогда
								Город = "Москва";
							ИначеЕсли ДанныеАдреса.area = "Санкт-Петербург" Тогда
								Город = "Санкт-Петербург";
							ИначеЕсли ДанныеАдреса.area = "Севастополь" Тогда
								Город = "Севастополь";
							ИначеЕсли ДанныеАдреса.area = "Байконур" Тогда
								Город = "Байконур";
							КонецЕсли;	
							Если Город <> "" Тогда 
								Запись.ЗаписатьНачалоЭлемента("city");
								Запись.ЗаписатьТекст(Город);
								Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДанныеАдреса.settlement) Тогда
								Запись.ЗаписатьНачалоЭлемента("settlement");
								Запись.ЗаписатьТекст(ДанныеАдреса.settlement);
								Запись.ЗаписатьКонецЭлемента();   
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДанныеАдреса.street) Тогда
								Запись.ЗаписатьНачалоЭлемента("street");
								Запись.ЗаписатьТекст(ДанныеАдреса.street);
								Запись.ЗаписатьКонецЭлемента();   
                            КонецЕсли;
							
							Если ЗначениеЗаполнено(ДанныеАдреса.houseNumber) Тогда
								Запись.ЗаписатьНачалоЭлемента("house");
								Запись.ЗаписатьТекст(ДанныеАдреса.houseNumber);
								Запись.ЗаписатьКонецЭлемента();   
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДанныеАдреса.buildings) И ДанныеАдреса.buildings.Количество() > 0 Тогда
								Запись.ЗаписатьНачалоЭлемента("building");
								Запись.ЗаписатьТекст(ДанныеАдреса.buildings[0].number);
								Запись.ЗаписатьКонецЭлемента(); 
							КонецЕсли;
						
							//Запись.ЗаписатьНачалоЭлемента("office");
							//Запись.ЗаписатьТекст(ДанныеАдреса);
							//Запись.ЗаписатьКонецЭлемента();   
							
							Если ЗначениеЗаполнено(ДанныеАдреса.value) Тогда
								Запись.ЗаписатьНачалоЭлемента("fullAddress");
								Запись.ЗаписатьТекст(ДанныеАдреса.value);
								Запись.ЗаписатьКонецЭлемента();
							КонецЕсли;
							
						Запись.ЗаписатьКонецЭлемента(); 
					КонецЕсли; 
					
				КонецЕсли;
				
				БанковскийСчет = Акт.Организация.БанковскийСчетПоУмолчанию;
				
				Если ЗначениеЗаполнено(БанковскийСчет) Тогда
					Запись.ЗаписатьНачалоЭлемента("additionalInfo");
					
						Запись.ЗаписатьНачалоЭлемента("bankAccountNumber");
						Запись.ЗаписатьТекст(БанковскийСчет.НомерСчета);
						Запись.ЗаписатьКонецЭлемента();

	        			Запись.ЗаписатьНачалоЭлемента("correspondentAccountNumber");
						Запись.ЗаписатьТекст(БанковскийСчет.Банк.КоррСчет);
						Запись.ЗаписатьКонецЭлемента();

						Запись.ЗаписатьНачалоЭлемента("bankName");
						Запись.ЗаписатьТекст(БанковскийСчет.Наименование);
						Запись.ЗаписатьКонецЭлемента();

               			Запись.ЗаписатьНачалоЭлемента("BIK");
						Запись.ЗаписатьТекст(БанковскийСчет.Банк.Код);
						Запись.ЗаписатьКонецЭлемента();
					
					Запись.ЗаписатьКонецЭлемента();
                КонецЕсли;
  			Запись.ЗаписатьКонецЭлемента();
			
			СуммаБезСкидки = 0;
			СуммаНДС = 0;

			Для Каждого Элемент Из Акт.ОказанныеУслуги Цикл
				Запись.ЗаписатьНачалоЭлемента("providedService");
					Прием = Элемент.ДокументОснования;
					// Данные о пациенте
					Запись.ЗаписатьНачалоЭлемента("insurant");
						Пациент = Элемент.ДокументОснования.Контрагент;
				    	Запись.ЗаписатьНачалоЭлемента("fullName"); 
						
							Запись.ЗаписатьНачалоЭлемента("lastName");
							Запись.ЗаписатьТекст(Пациент.Имя);
							Запись.ЗаписатьКонецЭлемента();
							
							Запись.ЗаписатьНачалоЭлемента("firstName");
							Запись.ЗаписатьТекст(Пациент.Фамилия);
							Запись.ЗаписатьКонецЭлемента();
							
							Запись.ЗаписатьНачалоЭлемента("middleName");
							Запись.ЗаписатьТекст(Пациент.Отчество);
							Запись.ЗаписатьКонецЭлемента();

                        Запись.ЗаписатьКонецЭлемента();
						
						Запись.ЗаписатьНачалоЭлемента("dateOfBirth");
						Запись.ЗаписатьТекст(Формат(Пациент.ДатаРожденияКлиента, "ДФ=yyyy-MM-dd"));
						Запись.ЗаписатьКонецЭлемента();
						
						Запись.ЗаписатьНачалоЭлемента("gender");
						Запись.ЗаписатьТекст(?(Пациент.ПолКлиента = Перечисления.ПолФизическогоЛица.Женский, "Female", "Male"));
						Запись.ЗаписатьКонецЭлемента();
						
						Запись.ЗаписатьНачалоЭлемента("insurancePolicy"); 
						
							Запись.ЗаписатьНачалоЭлемента("number");
							Запись.ЗаписатьТекст(Прием.ПолисМедСтрахования.НомерПолиса);
							Запись.ЗаписатьКонецЭлемента();
							
							Запись.ЗаписатьНачалоЭлемента("fromDate");
							Запись.ЗаписатьТекст(Формат(Прием.ПолисМедСтрахования.ДанаНачала, "ДФ=yyyy-MM-dd"));
							Запись.ЗаписатьКонецЭлемента();
							
							Запись.ЗаписатьНачалоЭлемента("toDate");
							Запись.ЗаписатьТекст(Формат(Прием.ПолисМедСтрахования.ДатаОкончания, "ДФ=yyyy-MM-dd"));
							Запись.ЗаписатьКонецЭлемента();

                        Запись.ЗаписатьКонецЭлемента(); 
						
						МассивАдресов =  Пациент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
						Если МассивАдресов.Количество() > 0 Тогда
				
							ДанныеАдреса = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(МассивАдресов[0].Значение, Перечисления.ТипыКонтактнойИнформации.Адрес);
				
							Если НЕ ДанныеАдреса.addressType = "ВСвободнойФорме" Тогда
						
								Запись.ЗаписатьНачалоЭлемента("russianAddress");
						
									Если ЗначениеЗаполнено(ДанныеАдреса.ZIPcode) Тогда
										Запись.ЗаписатьНачалоЭлемента("postalCode");
										Запись.ЗаписатьТекст(ДанныеАдреса.ZIPcode);
										Запись.ЗаписатьКонецЭлемента();   
									КонецЕсли;	
									
									//Запись.ЗаписатьНачалоЭлемента("regionISOCode");
									//Запись.ЗаписатьТекст(ДанныеАдреса);
									//Запись.ЗаписатьКонецЭлемента();   
							
									Если ЗначениеЗаполнено(ДанныеАдреса.district) Тогда
  										Запись.ЗаписатьНачалоЭлемента("district");
										Запись.ЗаписатьТекст(ДанныеАдреса.district);
										Запись.ЗаписатьКонецЭлемента();   
									КонецЕсли;	
							
									Город = ДанныеАдреса.city;
									Если ДанныеАдреса.area = "Москва" Тогда
										Город = "Москва";
									ИначеЕсли ДанныеАдреса.area = "Санкт-Петербург" Тогда
										Город = "Санкт-Петербург";
									ИначеЕсли ДанныеАдреса.area = "Севастополь" Тогда
										Город = "Севастополь";
									ИначеЕсли ДанныеАдреса.area = "Байконур" Тогда
										Город = "Байконур";
									КонецЕсли;	
									Если Город <> "" Тогда 
										Запись.ЗаписатьНачалоЭлемента("city");
										Запись.ЗаписатьТекст(Город);
										Запись.ЗаписатьКонецЭлемента();
									КонецЕсли;
							
									Если ЗначениеЗаполнено(ДанныеАдреса.settlement) Тогда
										Запись.ЗаписатьНачалоЭлемента("settlement");
										Запись.ЗаписатьТекст(ДанныеАдреса.settlement);
										Запись.ЗаписатьКонецЭлемента();   
									КонецЕсли;
							
									Если ЗначениеЗаполнено(ДанныеАдреса.street) Тогда
										Запись.ЗаписатьНачалоЭлемента("street");
										Запись.ЗаписатьТекст(ДанныеАдреса.street);
										Запись.ЗаписатьКонецЭлемента();   
                        		    КонецЕсли;
							
									Если ЗначениеЗаполнено(ДанныеАдреса.houseNumber) Тогда
										Запись.ЗаписатьНачалоЭлемента("house");
										Запись.ЗаписатьТекст(ДанныеАдреса.houseNumber);
										Запись.ЗаписатьКонецЭлемента();   
									КонецЕсли;
							
									Если ЗначениеЗаполнено(ДанныеАдреса.buildings) И ДанныеАдреса.buildings.Количество() > 0 Тогда
										Запись.ЗаписатьНачалоЭлемента("building");
										Запись.ЗаписатьТекст(ДанныеАдреса.buildings[0].number);
										Запись.ЗаписатьКонецЭлемента(); 
									КонецЕсли;
						
									//Запись.ЗаписатьНачалоЭлемента("office");
									//Запись.ЗаписатьТекст(ДанныеАдреса);
									//Запись.ЗаписатьКонецЭлемента();   
							
									Если ЗначениеЗаполнено(ДанныеАдреса.value) Тогда
										Запись.ЗаписатьНачалоЭлемента("fullAddress");
										Запись.ЗаписатьТекст(ДанныеАдреса.value);
										Запись.ЗаписатьКонецЭлемента();
									КонецЕсли;
							
								Запись.ЗаписатьКонецЭлемента(); 
							КонецЕсли; 
					
						КонецЕсли;

				    Запись.ЗаписатьКонецЭлемента();	
					
					// Данные о приеме

					Запись.ЗаписатьНачалоЭлемента("treatment"); 
						
					    ОбследованиеПациента = РегистрыСведений.ЗначенияПараметровОбследований.ПолучитьМенеджераВременнойТаблицыОбследованияСтоматолога(Пациент, Прием);  
						Если ЗначениеЗаполнено(ОбследованиеПациента.Найти("Диагноз")) Тогда
							МКБ10 = ОбследованиеПациента.Найти("Диагноз").КодМКБ10;
							КодПоМКБ10 = ИнтеграцияИЭМК.УстановитьКодПоМКБ10(МКБ10);
							Диагноз = ОбследованиеПациента.Найти("Диагноз").РеквизитЗначение;
						
							Запись.ЗаписатьНачалоЭлемента("diagnosis");	
							
								Запись.ЗаписатьНачалоЭлемента("diagnosisCode");
                    	        Запись.ЗаписатьТекст(МКБ10);
								Запись.ЗаписатьКонецЭлемента();
								
                    	        Запись.ЗаписатьНачалоЭлемента("diagnosisDescription");
                    	        Запись.ЗаписатьТекст(Диагноз);
								Запись.ЗаписатьКонецЭлемента();
 						
							Запись.ЗаписатьКонецЭлемента();
						КонецЕсли;
					
						Запись.ЗаписатьНачалоЭлемента("doctorFullName");
						Запись.ЗаписатьТекст(Прием.Сотрудник.Наименование);
						Запись.ЗаписатьКонецЭлемента();
						
						Запись.ЗаписатьНачалоЭлемента("lineItems");
						
							Для Каждого Элемент Из Прием.Лечение Цикл
								Запись.ЗаписатьНачалоЭлемента("lineItem");
								
									Запись.ЗаписатьНачалоЭлемента("name");
								 	Запись.ЗаписатьТекст(Элемент.Номенклатура.Наименование);
									Запись.ЗаписатьКонецЭлемента();
								    								
									Запись.ЗаписатьНачалоЭлемента("payerServiceCode");
								 	Запись.ЗаписатьТекст(СтроковыеФункцииКлиентСерверСтоматология.ТранслитерацияРусАнгл(Элемент.Номенклатура.НоменклатураМедицинскихУслуг.Код));
									Запись.ЗаписатьКонецЭлемента();
								    								
									Запись.ЗаписатьНачалоЭлемента("supplierServiceCode");
								 	Запись.ЗаписатьТекст(СтроковыеФункцииКлиентСерверСтоматология.ТранслитерацияРусАнгл(Элемент.Номенклатура.НоменклатураМедицинскихУслуг.Код));
									Запись.ЗаписатьКонецЭлемента();
																	
									Запись.ЗаписатьНачалоЭлемента("serviceDate");
								 	Запись.ЗаписатьТекст(Формат(Прием.ВремяНачалаПриема, "ДФ=yyyy-MM-dd"));
									Запись.ЗаписатьКонецЭлемента();
									
									Запись.ЗаписатьНачалоЭлемента("dentalInformation");
										Запись.ЗаписатьНачалоЭлемента("toothNumber");
										Запись.ЗаписатьТекст(Строка(Элемент.Зуб));
                                        Запись.ЗаписатьКонецЭлемента();
									Запись.ЗаписатьКонецЭлемента();

									Запись.ЗаписатьНачалоЭлемента("confirmedQuantity"); 
									Запись.ЗаписатьАтрибут("measurementUnitCode", "PCE");
 									Запись.ЗаписатьТекст(Формат(Элемент.Количество, "ЧДЦ=4; ЧРД=.; ЧГ="));
                                    Запись.ЗаписатьКонецЭлемента();
									
                                    Запись.ЗаписатьНачалоЭлемента("serviceStatus"); 
									Запись.ЗаписатьТекст("Added");
									Запись.ЗаписатьКонецЭлемента();

                                    Запись.ЗаписатьНачалоЭлемента("healthCareResponseIdentificator"); 
									Запись.ЗаписатьАтрибут("number", Прием.ПолисМедСтрахования.НомерГарантийногоПисьма);
 									Запись.ЗаписатьАтрибут("date", Формат(Прием.ПолисМедСтрахования.ДатаГарантийногоПисьма, "ДФ=yyyy-MM-dd"));
                                    Запись.ЗаписатьКонецЭлемента();
									
									Запись.ЗаписатьНачалоЭлемента("price"); 
									Запись.ЗаписатьТекст(Формат(Элемент.Цена, "ЧДЦ=4; ЧРД=.; ЧГ="));
									Запись.ЗаписатьКонецЭлемента();
									
									Если Акт.Договор.ПроцентСкидки <> 0 Тогда
														
										Запись.ЗаписатьНачалоЭлемента("totalSumModifierPercent"); 
										Запись.ЗаписатьТекст(Формат(Акт.Договор.ПроцентСкидки, "ЧДЦ=4; ЧРД=.; ЧГ="));
										Запись.ЗаписатьКонецЭлемента();

									КонецЕсли;
									
									СуммаНДС = СуммаНДС + Элемент.СуммаНДС;
									СуммаБезСкидки = СуммаБезСкидки + Элемент.Количество * Элемент.Цена;
									
									//Запись.ЗаписатьНачалоЭлемента("totalWithoutDiscountCharge"); 
									//Запись.ЗаписатьТекст(Формат(Элемент.Количество * Элемент.Цена, "ЧДЦ=4; ЧРД=.; ЧГ="));
									//Запись.ЗаписатьКонецЭлемента();

									Запись.ЗаписатьНачалоЭлемента("total"); 
									Запись.ЗаписатьТекст(Формат(Элемент.Сумма, "ЧДЦ=4; ЧРД=.; ЧГ="));
									Запись.ЗаписатьКонецЭлемента();
          
								Запись.ЗаписатьКонецЭлемента();
							КонецЦикла;	
						Запись.ЗаписатьКонецЭлемента();
					Запись.ЗаписатьКонецЭлемента();
				Запись.ЗаписатьКонецЭлемента();	
			КонецЦикла;
			
			Запись.ЗаписатьНачалоЭлемента("proformaInvoiceSumInfo"); 
				Запись.ЗаписатьНачалоЭлемента("total");
				Если Акт.Договор.ПроцентСкидки <> 0 Тогда
					ОбщаяСумма = (Акт.СуммаДокумента + СуммаНДС)*(100 - Акт.Договор.ПроцентСкидки) / 100;
				Иначе
					ОбщаяСумма = Акт.СуммаДокумента + СуммаНДС;	
				КонецЕсли;
				Запись.ЗаписатьТекст(Формат(ОбщаяСумма, "ЧДЦ=4; ЧРД=.; ЧГ="));
				Запись.ЗаписатьКонецЭлемента();
	        Запись.ЗаписатьКонецЭлемента();

			Запись.ЗаписатьНачалоЭлемента("acceptanceCertificateInfo"); 
            	Запись.ЗаписатьНачалоЭлемента("total");
				Запись.ЗаписатьТекст(Формат(ОбщаяСумма, "ЧДЦ=4; ЧРД=.; ЧГ="));
				Запись.ЗаписатьКонецЭлемента();
				
  				Запись.ЗаписатьНачалоЭлемента("totalWithVat"); 
				Запись.ЗаписатьТекст(Формат(ОбщаяСумма + СуммаНДС, "ЧДЦ=4; ЧРД=.; ЧГ="));
				Запись.ЗаписатьКонецЭлемента();
				
				Запись.ЗаписатьНачалоЭлемента("totalVat"); 
				Запись.ЗаписатьТекст(Формат(СуммаНДС, "ЧДЦ=4; ЧРД=.; ЧН=0.0000; ЧГ="));
				Запись.ЗаписатьКонецЭлемента();
			Запись.ЗаписатьКонецЭлемента();
			
			Запись.ЗаписатьНачалоЭлемента("totalSum"); 
			Запись.ЗаписатьТекст(Формат(Акт.СуммаДокумента + СуммаНДС, "ЧДЦ=4; ЧРД=.; ЧГ="));
			Запись.ЗаписатьКонецЭлемента();			
			
			Запись.ЗаписатьНачалоЭлемента("totalVAT"); 
			Запись.ЗаписатьТекст(Формат(СуммаНДС, "ЧДЦ=4; ЧРД=.; ЧН=0.0000; ЧГ="));
			Запись.ЗаписатьКонецЭлемента();			
			
			Запись.ЗаписатьНачалоЭлемента("totalSumWithVAT"); 
			Запись.ЗаписатьТекст(Формат(Акт.СуммаДокумента + СуммаНДС, "ЧДЦ=4; ЧРД=.; ЧГ="));
			Запись.ЗаписатьКонецЭлемента();
			
			Запись.ЗаписатьНачалоЭлемента("totalDiscountSum"); 
			Запись.ЗаписатьТекст(Формат(?(Акт.Договор.ПроцентСкидки <> 0,Акт.СуммаДокумента/ 100 * Акт.Договор.ПроцентСкидки, 0), "ЧДЦ=4; ЧРД=.; ЧГ="));
			Запись.ЗаписатьКонецЭлемента();

		Запись.ЗаписатьКонецЭлемента();
	Запись.ЗаписатьКонецЭлемента();
	Запись.Закрыть(); 

	Возврат ПутьКФайлу;
	
КонецФункции

&НаКлиенте
// Процедура лтправляет данные в Контур.Страхование
//
Процедура ОтправитьДанныеВКС(Команда)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ВызватьИсключение "Выберите строку с нужным событием";
	КонецЕсли;
	
	ОтправитьДанныеВКСНаСервере(ТекСтрока.Ссылка);  
	
КонецПроцедуры

&НаСервере
// Фунция возвращает путь для покдключения к Контур.Страхование
//
Функция ХостАпи(Демо)
	
	Возврат ?(Демо, "medi-api.testkontur.ru", "medi-api.kontur.ru");
	
КонецФункции

&НаСервере
// Функция Клиент Post
//
Функция Клиент_POST(Запрос, Хост)
	
	Возврат ВыполнитьHTTPМетод("POST", Запрос, Хост);
		
КонецФункции

&НаСервере
// функция возвращает http соединение
//
Функция Соединение(Хост)

	Порт = 443;
	
	Соединение = Новый HTTPСоединение(Хост, Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
	Возврат Соединение;

КонецФункции

&НаСервере 
// Функция выполняет http метод
//
Функция ВыполнитьHTTPМетод(Метод, Запрос, Хост)
	
	Возврат Соединение(Хост).ВызватьHTTPМетод(Метод, Запрос);
	
КонецФункции

&НаКлиенте
// Процедура обработчик события Список при активации строки
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если Не Элементы.Найти("ОтправитьДанныеВКС") = Неопределено Тогда
			Элементы.ОтправитьДанныеВКС.Доступность = Не ТекущиеДанные.ОтправленВКонтурСтрахование; 		
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
